Revit 2027 API
ExportIFCCategoryKey.CustomSubCategoryId Property
 The Revit custom subcategory id.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CustomSubCategoryId CustomSubCategoryId { get; set; }
Public Property CustomSubCategoryId As CustomSubCategoryId
	Get
	Set
public:
property CustomSubCategoryId CustomSubCategoryId {
	CustomSubCategoryId get ();
	void set (CustomSubCategoryId value);
}
member CustomSubCategoryId : CustomSubCategoryId with get, set
Property Value
CustomSubCategoryId
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ExportIFCCategoryKey Class
Autodesk.Revit.DB Namespace